; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	image1 - mode
	infrared0 - mode
	spectrograph2 - mode
	Star2 - direction
	Star7 - direction
	GroundStation13 - direction
	GroundStation11 - direction
	GroundStation8 - direction
	Star10 - direction
	GroundStation0 - direction
	GroundStation6 - direction
	GroundStation9 - direction
	Star14 - direction
	Star3 - direction
	Star1 - direction
	Star5 - direction
	GroundStation4 - direction
	GroundStation12 - direction
	Phenomenon15 - direction
	Star16 - direction
	Star17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star14)
	(calibration_target instrument1 GroundStation12)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 image1)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation11)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation12)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star10)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 Star1)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 GroundStation8)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star14)
	(supports instrument4 infrared0)
	(supports instrument4 image1)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 GroundStation12)
	(calibration_target instrument4 Star14)
	(calibration_target instrument4 GroundStation9)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 GroundStation6)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation12)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 Star3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation11)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(have_image Phenomenon15 image1)
	(have_image Star16 spectrograph2)
	(have_image Star17 image1)
	(have_image Planet18 spectrograph2)
))

)

; plan
1. (turn_to satellite0 groundstation0 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 5
4. (turn_to satellite0 planet18 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet18)
   goals met: 0 of 5
5. (take_image satellite0 planet18 instrument0 spectrograph2)
   added: (have_image planet18 spectrograph2)
   goals met: 1 of 5
6. (turn_to satellite0 phenomenon15 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 phenomenon15)
   goals met: 1 of 5
7. (take_image satellite0 phenomenon15 instrument0 image1)
   added: (have_image phenomenon15 image1)
   goals met: 2 of 5
8. (turn_to satellite0 star16 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star16)
   goals met: 2 of 5
9. (take_image satellite0 star16 instrument0 spectrograph2)
   added: (have_image star16 spectrograph2)
   goals met: 3 of 5
10. (turn_to satellite0 star17 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star17)
   goals met: 3 of 5
11. (take_image satellite0 star17 instrument0 image1)
   added: (have_image star17 image1)
   goals met: 4 of 5
12. (turn_to satellite0 groundstation4 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 groundstation4)
   goals met: 5 of 5
